"""邬宗圆的代码"""
#任务一
# dict={"北京":{"朝阳区":"狼腾测试员"},
#       "上海":{"黄浦区":"狼腾测试员"},
#       "广州":{"海珠区":"狼腾测试员"}
#       }
# Beijing=input("请输入您的地名：")
# if Beijing=="北京":
#     chaoyang = input("请输入您的区名：")
#     if chaoyang == "朝阳区":
#         print(dict[Beijing][chaoyang])
#
# Shanghai=input("请输入您的地名：")
# if Shanghai=="上海":
#     huangpu = input("请输入您的区名：")
#     if huangpu == "黄浦区":
#         print(dict[Shanghai][huangpu])
#
# Guangzhou = input("请输入您的地名：")
# if Guangzhou == "广州":
#     haizhu = input("请输入您的区名：")
#     if haizhu == "海珠区":
#         print(dict[Guangzhou][haizhu])

#任务二
# dict={"苹果":"32.8元",
#       "香蕉":"22元",
#       "葡萄":"15.5元"
#       }
# X=input("请输入水果名：")
# if X=="苹果":
#     print(dict[X])
# if X=="香蕉":
#     print(dict[X])
# if X=="葡萄":
#     print(dict[X])

#任务三
# friuts = {
#     "苹果":12.3,
#     "草莓":4.5,
#     "香蕉":6.3,
#     "葡萄":5.8,
#     "橘子":6.4,
#     "樱桃":15.8
# }
# info = {
#     '小明':{
#         'fruits':{'苹果':4,'草莓':13,'香蕉':10},
#         'money':4*12.3+13*4.5+10*6.3
#     },
#     '小刚':{
#         'fruits':{'葡萄':19,'橘子':12,'樱桃':30},
#         'money':19*5.8+12*6.4+30*15.8
#     }
# }
# X=input("请输入姓名：")
# if X=='小明':
#     print(info[X])
# if X=='小刚':
#     print(info[X])

#任务四
"""编写一个函数，传入一个列表，并统计每个数字出现的次数"""
# list1 = [1,2,3,1,2,3,1,2,3]
# iCount = list1.count(1)
# print(iCount)

#任务五
# 姓名  年龄  性别  编号   任职公司   薪资   部门编号
# names = [
#     ["刘备","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["张飞", "45", "男", "230", "Tencent", 700 , "10"]
# ]
# dict = {
#     "刘备":{"56":{"男":{"106":{"IBM":{"50":{500}}}}}},
#     "大乔":{"19":{"女":{"230":{"微软":{"60":{501}}}}}},
#     "小乔":{"19":{"女":{"210":{"Oracle":{"60":{600}}}}}},
#     "张飞":{"45":{"男":{"230":{"Tencent":{"10":{700}}}}}}
# }
# X = input("请输入姓名：")
# if X == "刘备":
#     print(dict[X])
# if X == "大乔":
#     print(dict[X])
# if X == "小乔":
#     print(dict[X])
# if X == "张飞":
#     print(dict[X])